hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_master_driver.c
    /* Configure the run-time state struct with the DSPI source clock */
    dspiEdmaState->dspiSourceClock = dspiSourceClock;

    /* Configure the run-time state struct with the data command parameters*/
    dspiEdmaState->whichCtar = userConfig->whichCtar;  /* set the dspiEdmaState struct CTAR*/
    dspiEdmaState->whichPcs = userConfig->whichPcs;  /* set the dspiEdmaState struct whichPcs*/
    dspiEdmaState->isChipSelectContinuous = userConfig->isChipSelectContinuous; /* continuous PCS*/

    /* Initialize the DSPI module registers to default value, which disables the module */
    DSPI_HAL_Init(baseAddr);

    /* Init the interrupt sync object.*/
    if (OSA_SemaCreate(&dspiEdmaState->irqSync, 0) != kStatus_OSA_Success)
    {
        return kStatus_DSPI_Error;
    }

    /* Initialize the DSPI module with user config */

    /* Set to master mode.*/
    DSPI_HAL_SetMasterSlaveMode(baseAddr, kDspiMaster);

    /* Configure for continuous SCK operation*/
    DSPI_HAL_SetContinuousSckCmd(baseAddr, userConfig->isSckContinuous);

    /* Configure for peripheral chip select polarity*/
    DSPI_HAL_SetPcsPolarityMode(baseAddr, userConfig->whichPcs, userConfig->pcsPolarity);

    /* Enable fifo operation (regardless of FIFO depth) */
    DSPI_HAL_SetFifoCmd(baseAddr, true, true);

    /* Initialize the configurable delays: PCS-to-SCK, prescaler = 0, scaler = 1 */
    DSPI_HAL_SetDelay(baseAddr, userConfig->whichCtar, 0, 1, kDspiPcsToSck);

    /* Save runtime structure pointers to irq handler can point to the correct state structure*/
    g_dspiStatePtr[instance] = dspiEdmaState;

    /* enable the interrupt*/
    INT_SYS_EnableIRQ(g_dspiIrqId[instance]);

    /* DSPI system enable */
    DSPI_HAL_Enable(baseAddr);


    /* Request DMA channels from the EDMA peripheral driver.
     * Note, some MCUs have a separate RX and TX DMA request for each DSPI instance, while
     * other MCUs have a separate RX and TX DMA request for DSPI instance 0 only and shared DMA
     * requests for all other instances. Therefore, use the DSPI feature file to distinguish
     * how to request DMA channels between the various MCU DSPI instances.
     * For DSPI instances with shared RX/TX DMA requests, we'll use the RX DMA request to
     * trigger ongoing transfers and will link to the TX DMA channel from the RX DMA channel.
     */
    if (instance == 0)
    {
        /* Set up channels for separate RX/TX DMA requests */
        /* This channel transfers data from RX FIFO to receiveBuffer */
        EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                kDmaRequestMux0SPI0Rx,
                                &dspiEdmaState->dmaFifo2Receive);
        /* Intermediate command/data to TX FIFO (PUSHR). */
        EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                kDmaRequestMux0SPI0Tx,
                                &dspiEdmaState->dmaCmdData2Fifo);
    }

#if (SPI_INSTANCE_COUNT > 1) /* Continue only if the MCU has another DSPI instance */
    else if (instance == 1)
    {
        /* Set up channels for separate RX/TX DMA requests */
#if FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(1)
        {
            /* This channel transfers data from RX FIFO to receiveBuffer */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI1Rx,
                                    &dspiEdmaState->dmaFifo2Receive);
            /* Intermediate command/data to TX FIFO (PUSHR). */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI1Tx,
                                    &dspiEdmaState->dmaCmdData2Fifo);
        }
#else /* Set up channels for shared RX/TX DMA request */
        {
            /* This channel transfers data from RX FIFO to receiveBuffer */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI1,
                                    &dspiEdmaState->dmaFifo2Receive);
            /* Intermediate command/data to TX FIFO (PUSHR) linked from RX channel.
             * This channel is not activated by dma request, but by channel link from RX.
             */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0Disable,
                                    &dspiEdmaState->dmaCmdData2Fifo);
        }
#endif
    }
#else
    errorCode = kStatus_DSPI_InvalidInstanceNumber;
#endif

#if (SPI_INSTANCE_COUNT > 2) /* Continue only if the MCU has another DSPI instance */
    else
    {
        /* Set up channels for separate RX/TX DMA requests */
#if (FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(2))
        {
            /* This channel transfers data from RX FIFO to receiveBuffer */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI2Rx,
                                    &dspiEdmaState->dmaFifo2Receive);
            /* Intermediate command/data to TX FIFO (PUSHR). */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI2Tx,
                                    &dspiEdmaState->dmaCmdData2Fifo);
        }
#else /* Set up channels for shared RX/TX DMA request */
        {
            /* This channel transfers data from RX FIFO to receiveBuffer */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0SPI2,
                                    &dspiEdmaState->dmaFifo2Receive);
            /* Intermediate command/data to TX FIFO (PUSHR) linked from RX channel.
             * This channel is not activated by dma request, but by channel link from RX.
             */
            EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                                    kDmaRequestMux0Disable,
                                    &dspiEdmaState->dmaCmdData2Fifo);
        }
#endif
    }
#else
    errorCode = kStatus_DSPI_InvalidInstanceNumber;
#endif

    /* Source buffer to intermediate command/data
     * This channel is not activated by dma request, but by channel link.
     */
    EDMA_DRV_RequestChannel(kEDMAAnyChannel,
                            kDmaRequestMux0Disable,
                            &dspiEdmaState->dmaSrc2CmdData);

    /**************************************************************************************
     * Update run-time state struct with the pointer to Software Transfer Control Descriptor
     **************************************************************************************/
    dspiEdmaState->stcdSrc2CmdDataLast = stcdSrc2CmdDataLast;

    /* Start the transfer process in the hardware */
    DSPI_HAL_StartTransfer(baseAddr);

    return errorCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : DSPI_DRV_EdmaMasterDeinit
 * Description   : Shuts down a DSPI instance with EDMA support.
 *
 * This function resets the DSPI peripheral, gates its clock, disables any used interrupts to
 * the core, and releases any used DMA channels.
 *
 *END**************************************************************************/
void DSPI_DRV_EdmaMasterDeinit(uint32_t instance)
{
    /* instantiate local variable of type dspi_edma_master_state_t and point to global state */
    dspi_edma_master_state_t * dspiEdmaState = (dspi_edma_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* First stop transfers */
    DSPI_HAL_StopTransfer(baseAddr);

    /* Restore the module to defaults then power it down. This also disables the DSPI module.*/
    DSPI_HAL_Init(baseAddr);

