hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_master_driver.c
            /* Note, if the extraByte flag is set and we're down to the last two bytes we can still
             * do this even though we're going past the sendBuffer size. We're just reading data we
             * don't care about anyways since it is dummy data to make up for the last byte.
             */
            s_wordToSend |= (unsigned)(*sendBuffer) << 8U;
            ++sendBuffer; /* increment to next data byte */

        }
        txTransferByteCnt -= 2;  /* decrement txTransferByteCnt by 2 bytes */
    }

    s_cmdData |= s_wordToSend; /* write s_wordToSend to intermediate buffer */

    /************************************************************************************
     * Transfer Control Descriptor set up for Intermediate command/data to TX
     * FIFO (PUSHR). AKA "Channel 1"
     * Note, actual channel number may very depending on DMA system usage.
     * This channels links to "Channel 1" on completion of MAJOR loop.  "Channel 1" is
     * the channel that transfers data from the send source buffer to the intermediate
     * command/data buffer.
     * Note that the channel linking is based on the MAJOR loop complete and not on minor
     * loop.  This is because we are only sending one 32-bit word so when the minor loop
     * completes, the MAJOR loop also completes.  The eDMA does not channel link on the
     * last iteration of the MAJOR loop using the ELINK mechanism, hence we have to link
     * on the MAJOR loop completion using MAJORLINK channel linking.
     ************************************************************************************/
    /* For each transfer control descriptor set up, save off DMA instance and channel number
     * to simplified variable names to make code cleaner
     */
    dmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiEdmaState->dmaCmdData2Fifo.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiEdmaState->dmaCmdData2Fifo.channel);

    /* If txTransferByteCnt is 0, then send last command/data since this is the
     * last data word to send
     */
    if (txTransferByteCnt == 0)
    {
        /* Source address is the last command/data intermediate buffer */
        EDMA_HAL_HTCDSetSrcAddr(dmaBaseAddr, dmaChannel,(uint32_t)(&s_lastCmdData));

        /* Disable ERQ request at end of major count */
        EDMA_HAL_HTCDSetDisableDmaRequestAfterTCDDoneCmd(dmaBaseAddr, dmaChannel, true);

        /* Disable majorlink request */
        EDMA_HAL_HTCDSetChannelMajorLink(dmaBaseAddr, dmaChannel, 0, false);
    }
    /* Else, send the intermediate buffer  */
    else
    {
        /* Source addr, intermediate command/data*/
        EDMA_HAL_HTCDSetSrcAddr(dmaBaseAddr, dmaChannel,(uint32_t)(&s_cmdData));

        /* Set the MAJOR link channel to link to the next channel that will pull data from
         * the source buffer into the intermediate command/data buffer and enable MAJOR link
         */
        EDMA_HAL_HTCDSetChannelMajorLink(dmaBaseAddr, dmaChannel,
                        VIRTUAL_CHN_TO_EDMA_CHN(dspiEdmaState->dmaSrc2CmdData.channel), true);

        /* Do not disable ERQ request at end of major count */
        EDMA_HAL_HTCDSetDisableDmaRequestAfterTCDDoneCmd(dmaBaseAddr, dmaChannel, false);
    }

    /* Source addr offset is 0 as source addr never increments */
    EDMA_HAL_HTCDSetSrcOffset(dmaBaseAddr, dmaChannel, 0);

    /* source size 32-bits */
    /* destination size 32bits*/
    /* Clear the SMOD and DMOD fields */
    EDMA_HAL_HTCDSetAttribute(dmaBaseAddr, dmaChannel,
                              kEDMAModuloDisable, kEDMAModuloDisable,
                              kEDMATransferSize_4Bytes, kEDMATransferSize_4Bytes);

    /* Transfer 4 bytes or one word */
    EDMA_HAL_HTCDSetNbytes(dmaBaseAddr, dmaChannel, 4);

    /* Don't increment source address, it is constant */
    EDMA_HAL_HTCDSetSrcLastAdjust(dmaBaseAddr, dmaChannel, 0);

    /* Destination is SPI PUSHR TX FIFO */
    EDMA_HAL_HTCDSetDestAddr(dmaBaseAddr, dmaChannel, DSPI_HAL_GetMasterPushrRegAddr(baseAddr));

    /* No dest addr offset, since we never increment the dest addr */
    EDMA_HAL_HTCDSetDestOffset(dmaBaseAddr, dmaChannel, 0);

    /* We are only sending one 32-bit word, so MAJOR count is "1". Do not use "ELINK"
     * to link channels, use MAJORLINK in CSR, therefore disable minor link (ELINK=0)
     */
    EDMA_HAL_HTCDSetChannelMinorLink(dmaBaseAddr, dmaChannel, 0, false);
    EDMA_HAL_HTCDSetMajorCount(dmaBaseAddr, dmaChannel, 1);

    /* No adjustment needed for destination addr or scatter/gather */
    EDMA_HAL_HTCDSetScatterGatherCmd(dmaBaseAddr, dmaChannel, false);

    /* Implement the following DMA channel set up only if we still have data yet to send
     * Otherwise, bypass this and enable the DSPI Transmit DMA request.
     */
    if (txTransferByteCnt != 0)
    {
        /************************************************************************************
         * Scatter/gather STCD set up
         * STCD ONLY for Last intermediate command/data to PUSHR. Do not call
         * edma_hal_stcd_push_to_htcd as this is used for "Channel 2" scatter/gather.
         * Hence we will call this "Channel 2 prime". This needs to be defined before
         * setting up "Channel 2" as it needs the address for this STCD.
         *
         * IMPORTANT: Per eDMA spec, the pointer address for this STCD structure needs to be
         *            aligned on 32-byte boundaries.
         ************************************************************************************/
        /* This channel should use scatter gather method, first configure the last STCD */
        memset(&config, 0, sizeof(edma_transfer_config_t));
        memset(dspiEdmaState->stcdSrc2CmdDataLast, 0, sizeof(edma_software_tcd_t));

        /* Fill out members of the EDMA transfer config structure and then use this structure to
         * prepare the software transfer control descriptor stcdSrc2CmdDataLast
         */
        config.srcAddr = (uint32_t)(&s_lastCmdData); /* Source addr is last data + last command */
        config.srcOffset = 0;
        config.srcTransferSize = kEDMATransferSize_4Bytes;
        config.destTransferSize = kEDMATransferSize_4Bytes;
        config.destAddr = (uint32_t)(&s_cmdData); /* Destination is the command/data buffer */
        config.destOffset = 0;
        config.destLastAddrAdjust = 0;
        config.srcLastAddrAdjust = 0;
        config.destModulo = kEDMAModuloDisable;
        config.srcModulo = kEDMAModuloDisable;
        config.majorLoopCount = 1; /* We are only sending one 32-bit word, so MAJOR count is "1" */
        config.minorLoopCount = 4; /* Transfer 4 bytes or one word */
        EDMA_DRV_PrepareDescriptorTransfer(&dspiEdmaState->dmaSrc2CmdData,
                dspiEdmaState->stcdSrc2CmdDataLast, &config,false,true);

        /* If at this point we are left with only sending one more data byte/word, then this
         * is the last command/data to send.  So the transfer control descriptor should move the
         * last command/data word into the intermediate buffer and this will get transferred to the
         * DSPI when the FIFO is ready for this.
         */
        if (((dspiEdmaState->bitsPerFrame <= 8) && ((txTransferByteCnt-1) == 0)) ||
            ((dspiEdmaState->bitsPerFrame > 8) && ((txTransferByteCnt-2) == 0)))
        {
            /* push the contents of the SW TCD to the HW TCD registers */
            EDMA_DRV_PushDescriptorToReg(&dspiEdmaState->dmaSrc2CmdData,
                                         dspiEdmaState->stcdSrc2CmdDataLast);
        }
        /* Otherwise, we are left with more data to send, so use the transfer control
         * descriptor that will move data from the send source buffer to the intermediate
         * command/data buffer.
         */
        else
        {
            /************************************************************************************
             * Transfer Control Descriptor set up for Source buffer to intermediate
             * command/data (this is a linked channel). AKA "Channel 2"
             * Note, actual channel number may very depending on DMA system usage
             * This channel is triggered by the completion of "Channel 1". It transfers data from
             * the send source buffer to the intermediate command/data word. When the source
             * buffer transfers the word before the last data word, the MAJOR loop completes
             * and triggers the scatter/gather (ESG = 1) and loads the STCD that is set up to
             * transfer the last command/data word to the PUSHR.
             ************************************************************************************/
            dmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiEdmaState->dmaSrc2CmdData.channel);
            dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiEdmaState->dmaSrc2CmdData.channel);

            /* If a send buffer was provided, the word comes from there. Otherwise we set
             * the source address to point to the s_wordToSend variable that was set to 0.
             */
            if (sendBuffer)
            {
                /* Source addr is the "send" data buffer */
                EDMA_HAL_HTCDSetSrcAddr(dmaBaseAddr, dmaChannel, (uint32_t)(sendBuffer));
                /* Increment the source address by one byte after every transfer */
                EDMA_HAL_HTCDSetSrcOffset(dmaBaseAddr, dmaChannel, 1);
            }
            else
            {
                /* Source addr is the "send" data buffer */
                EDMA_HAL_HTCDSetSrcAddr(dmaBaseAddr, dmaChannel,
                                        (uint32_t)(&s_wordToSend));
                /* Don't increment the source address  */
                EDMA_HAL_HTCDSetSrcOffset(dmaBaseAddr, dmaChannel, 0);
            }

