hulei123/git123/apps/bus_pal/MKV46F15/dspi/src/fsl_dspi_edma_master_driver.c
            if (dspiEdmaState->bitsPerFrame <= 8)
            {
                /* Source and destination size: byte */
                EDMA_HAL_HTCDSetAttribute(dmaBaseAddr, dmaChannel,
                            kEDMAModuloDisable, kEDMAModuloDisable,
                            kEDMATransferSize_1Bytes, kEDMATransferSize_1Bytes);

                /* minor byte transfer: 1 byte (8-bit word) */
                EDMA_HAL_HTCDSetNbytes(dmaBaseAddr, dmaChannel, 1);

                /* Major loop count is equal to remaining number of bytes to send minus 1.
                 * That is because the last data byte/word is written to the last command/data
                 * intermediate buffer.
                 */
                EDMA_HAL_HTCDSetMajorCount(dmaBaseAddr, dmaChannel, (txTransferByteCnt-1));
            }
            else
            {
                /* Source size: byte and destination size: halfword */
                EDMA_HAL_HTCDSetAttribute(dmaBaseAddr, dmaChannel,
                            kEDMAModuloDisable, kEDMAModuloDisable,
                            kEDMATransferSize_1Bytes, kEDMATransferSize_2Bytes);

                /* minor byte transfer: 2 bytes (16-bit word) */
                EDMA_HAL_HTCDSetNbytes(dmaBaseAddr, dmaChannel, 2);

                /* Major loop count is equal to remaining number of 16-bit words to send
                 * hence need to convert remainingSendByteCount from byte to 16-bit word
                 */
                EDMA_HAL_HTCDSetMajorCount(dmaBaseAddr, dmaChannel, (txTransferByteCnt-2)/2);
            }

            /* Diable minor loop linking */
            EDMA_HAL_HTCDSetChannelMinorLink(dmaBaseAddr, dmaChannel, 0, false);

            /* Set SLAST to 0 */
            EDMA_HAL_HTCDSetSrcLastAdjust(dmaBaseAddr, dmaChannel, 0);

            /* Destination addr is the intermediate command/data buffer */
            EDMA_HAL_HTCDSetDestAddr(dmaBaseAddr, dmaChannel,(uint32_t)(&s_cmdData));

            /* No dest addr offset, since we never increment the dest addr */
            EDMA_HAL_HTCDSetDestOffset(dmaBaseAddr, dmaChannel, 0);

            /* Place the address of the scatter/gather in order to reload STCD for the final
             * last command/data word to be loaded to the intermediate buffer.
             * IMPORTANT: This address needs to be 32-byte aligned.
             */
            EDMA_HAL_HTCDSetScatterGatherLink(dmaBaseAddr, dmaChannel,
                                    (edma_software_tcd_t *)(dspiEdmaState->stcdSrc2CmdDataLast));
        }
    }

    dmaBaseAddr = VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(dspiEdmaState->dmaCmdData2Fifo.channel);
    dmaChannel = VIRTUAL_CHN_TO_EDMA_CHN(dspiEdmaState->dmaCmdData2Fifo.channel);

    /* For DSPI instances with separate RX/TX DMA requests, we'll use the TX DMA request to
     * trigger the TX DMA channel hence we'll enable the TX channel DMA request.
     */
    if (FSL_FEATURE_DSPI_HAS_SEPARATE_DMA_RX_TX_REQn(instance))
    {
        /* Now that the TCD was set up for each channel, enable the DSPI peripheral hardware request
         * for the first TX DMA channel.
         */
        EDMA_HAL_SetDmaRequestCmd(dmaBaseAddr, (edma_channel_indicator_t)dmaChannel, true);

        /* Enable TFFF request in the DSPI module */
        DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, true);
    }
    /* For DSPI instances with shared RX/TX DMA requests, we'll use the RX DMA request to
     * trigger ongoing transfers that will link to the TX DMA channel from the RX DMA channel.
     * So, we'll disable the TX channel DMA request and then we'll have to manually start the
     * TX DMA channel to get the tranfer process started, where the RX DMA channel will take care
     * of the ongoing transfers from there.
     */
    else /* For shared RX/TX DMA requests */
    {
        /* Disable the DSPI TX peripheral hardware request*/
        EDMA_HAL_SetDmaRequestCmd(dmaBaseAddr, (edma_channel_indicator_t)dmaChannel, false);

        /* Disable TFFF request in the DSPI module */
        DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);

        /* Manually start the TX DMA channel to get the process going */
        EDMA_HAL_TriggerChannelStart(dmaBaseAddr, (edma_channel_indicator_t)dmaChannel);
    }

    return kStatus_DSPI_Success;
}

/*!
 * @brief Finish up a transfer.
 * Cleans up after a transfer is complete. Interrupts are disabled, and the DSPI module
 * is disabled. This is not a public API as it is called from other driver functions.
 */
static void DSPI_DRV_EdmaMasterCompleteTransfer(uint32_t instance)
{
    /* instantiate local variable of type dspi_edma_master_state_t and point to global state */
    dspi_edma_master_state_t * dspiEdmaState = (dspi_edma_master_state_t *)g_dspiStatePtr[instance];
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* If an odd transfer count was provided when bits/frame > 8, then there will be an extra byte
     * received. Get this byte now and put it into the receive buffer if a receive buffer was
     * provided.
     */
    if ((dspiEdmaState->extraByte) && (dspiEdmaState->rxBuffer))
    {
        /* copy the final byte from the DSPI data register to the receive buffer */
        dspiEdmaState->rxBuffer[dspiEdmaState->rxTransferByteCnt] = DSPI_HAL_ReadData(baseAddr);
    }

    /* The transfer is complete.*/
    dspiEdmaState->isTransferInProgress = false;

    /* Disable the Receive FIFO Drain DMA Request */
    DSPI_HAL_SetRxFifoDrainDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);

    /* Disable TFFF DMA request */
    DSPI_HAL_SetTxFifoFillDmaIntMode(baseAddr, kDspiGenerateDmaReq, false);

    /* Disable End of Queue request */
    DSPI_HAL_SetIntMode(baseAddr, kDspiEndOfQueue, false);

    if (dspiEdmaState->isTransferBlocking)
    {
        /* Signal the synchronous completion object */
        OSA_SemaPost(&dspiEdmaState->irqSync);
    }
}

/*!
 * @brief Interrupt handler for DSPI master mode.
 * This handler uses the buffers stored in the dspi_master_state_t structs to transfer data.
 * This is not a public API as it is called whenever an interrupt occurs.
 */
void DSPI_DRV_EdmaMasterIRQHandler(uint32_t instance)
{
    uint32_t baseAddr = g_dspiBaseAddr[instance];

    /* If the interrupt is due to an end-of-queue, then complete. This interrupt is
     * is used during DMA operations and we want to handle this interrupt only
     * when DMA is being used.
     */
    if (DSPI_HAL_GetStatusFlag(baseAddr, kDspiEndOfQueue))
    {
        /* Complete the transfer. This disables the interrupts, so we don't wind up in
         * the ISR again.
         */
        DSPI_DRV_EdmaMasterCompleteTransfer(instance);
    }
}
/*******************************************************************************
 * EOF
 ******************************************************************************/

